# Data Manipulation

In [1]:
import pandas as pd
import numpy as np

In [2]:
# ndim()
ser = pd.Series([11,22,33])
ser.ndim

1

In [3]:
# axes() returns the list of the indexes for the row label
ser = pd.Series(np.arange(20,60,2)) ##[20,22,24...58]
ser.axes

[RangeIndex(start=0, stop=20, step=1)]

In [4]:
# values: returns actual value stored in the data set
ser.values

array([20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52,
       54, 56, 58])

In [5]:
ser

0     20
1     22
2     24
3     26
4     28
5     30
6     32
7     34
8     36
9     38
10    40
11    42
12    44
13    46
14    48
15    50
16    52
17    54
18    56
19    58
dtype: int64

In [6]:
# head(n): if n is given then that many rows from the top would be returned
# ...else top 5 rows would be returned

ser.head()

0    20
1    22
2    24
3    26
4    28
dtype: int64

In [7]:
ser.head(2)

0    20
1    22
dtype: int64

In [8]:
# tail(n): if n is given then that many rows from the end would be returned
# ...else last 5 rows would be returned
ser.tail()

15    50
16    52
17    54
18    56
19    58
dtype: int64

In [9]:
ser.tail(2)

18    56
19    58
dtype: int64

In [10]:
ser.head(10)

0    20
1    22
2    24
3    26
4    28
5    30
6    32
7    34
8    36
9    38
dtype: int64

In [11]:
ser.tail(10)

10    40
11    42
12    44
13    46
14    48
15    50
16    52
17    54
18    56
19    58
dtype: int64

In [13]:
# sum() on DataFrame
data = {'odd': np.arange(1,100,2),
       'even': np.arange(0,100,2)}
df = pd.DataFrame(data)
df.head()

   odd  even
0    1     0
1    3     2
2    5     4
3    7     6
4    9     8

In [14]:
# sum()
df.sum()

odd     2500
even    2450
dtype: int64

In [15]:
# std()
df.std()

odd     29.154759
even    29.154759
dtype: float64

In [16]:
# default axis value is 0 i.e column wise here
df.std(axis=0)

odd     29.154759
even    29.154759
dtype: float64

In [17]:
# row wise addition of values in a DF can be done by providing axis=1
df.sum(axis=1)

0       1
1       5
2       9
3      13
4      17
5      21
6      25
7      29
8      33
9      37
10     41
11     45
12     49
13     53
14     57
15     61
16     65
17     69
18     73
19     77
20     81
21     85
22     89
23     93
24     97
25    101
26    105
27    109
28    113
29    117
30    121
31    125
32    129
33    133
34    137
35    141
36    145
37    149
38    153
39    157
40    161
41    165
42    169
43    173
44    177
45    181
46    185
47    189
48    193
49    197
dtype: int64

In [28]:
# iterating a DataFrame - iteritems()
df = pd.DataFrame(np.random.randn(5,4),
                 columns=['col1', 'col2', 'col3', 'col4'])

df

       col1      col2      col3      col4
0  1.115173 -0.596415  0.633069  1.033213
1  0.030176  0.265409  0.298346  0.780963
2  1.298930  2.357994 -0.009889  0.743076
3 -0.390457 -1.054971 -0.867760 -0.498024
4 -1.102586  0.486171 -1.118178 -0.453491

In [29]:
# getting values as column wise
for col_name, column_value in df.iteritems():
    print(col_name)
    print(column_value)
    print("#"*20)

col1
0    1.115173
1    0.030176
2    1.298930
3   -0.390457
4   -1.102586
Name: col1, dtype: float64
####################
col2
0   -0.596415
1    0.265409
2    2.357994
3   -1.054971
4    0.486171
Name: col2, dtype: float64
####################
col3
0    0.633069
1    0.298346
2   -0.009889
3   -0.867760
4   -1.118178
Name: col3, dtype: float64
####################
col4
0    1.033213
1    0.780963
2    0.743076
3   -0.498024
4   -0.453491
Name: col4, dtype: float64
####################

In [30]:
# also column wise we can access in this way
df['col1']

0    1.115173
1    0.030176
2    1.298930
3   -0.390457
4   -1.102586
Name: col1, dtype: float64

In [31]:
df.head()

       col1      col2      col3      col4
0  1.115173 -0.596415  0.633069  1.033213
1  0.030176  0.265409  0.298346  0.780963
2  1.298930  2.357994 -0.009889  0.743076
3 -0.390457 -1.054971 -0.867760 -0.498024
4 -1.102586  0.486171 -1.118178 -0.453491

In [33]:
# getting data row wise(more examples in Module 4 session)
# ..without using the loop
df.iloc[0]

col1    1.115173
col2   -0.596415
col3    0.633069
col4    1.033213
Name: 0, dtype: float64

In [37]:
# iterrows() :iterates over each row and col_name and value
df = pd.DataFrame(np.random.rand(5,4),
                 columns=['col1', 'col2', 'col3', 'col4'])
df

       col1      col2      col3      col4
0  0.796417  0.399145  0.578732  0.299599
1  0.525377  0.037440  0.659777  0.507786
2  0.510684  0.601857  0.843803  0.130637
3  0.526774  0.259295  0.877237  0.709427
4  0.678906  0.193296  0.549725  0.325014

In [39]:
df.iterrows()

In [41]:
for row_index, row_value in df.iterrows():
    print(row_index)
    print(row_value)
    print("#"*20)

0
col1    0.796417
col2    0.399145
col3    0.578732
col4    0.299599
Name: 0, dtype: float64
####################
1
col1    0.525377
col2    0.037440
col3    0.659777
col4    0.507786
Name: 1, dtype: float64
####################
2
col1    0.510684
col2    0.601857
col3    0.843803
col4    0.130637
Name: 2, dtype: float64
####################
3
col1    0.526774
col2    0.259295
col3    0.877237
col4    0.709427
Name: 3, dtype: float64
####################
4
col1    0.678906
col2    0.193296
col3    0.549725
col4    0.325014
Name: 4, dtype: float64
####################

In [46]:
# itertuples: returns a named tuple
df = pd.DataFrame(np.random.rand(5,4),
                 columns=['col1', 'col2', 'col3', 'col4'])
df

       col1      col2      col3      col4
0  0.096104  0.908776  0.902382  0.160005
1  0.766322  0.881511  0.046323  0.112673
2  0.153797  0.314574  0.420909  0.621621
3  0.170464  0.754470  0.932564  0.503274
4  0.530026  0.581001  0.914930  0.467937

In [47]:
for row_value in df.itertuples():
    print(row_value)
    print(row_value.col1)
    print(row_value.col2)
    print("#"*20)

Pandas(Index=0, col1=0.09610384281933304, col2=0.9087763569533396, col3=0.9023823861354927, col4=0.16000511691609542)
0.09610384281933304
0.9087763569533396
####################
Pandas(Index=1, col1=0.7663215575775143, col2=0.8815113719773129, col3=0.046322696674615194, col4=0.11267314131839434)
0.7663215575775143
0.8815113719773129
####################
Pandas(Index=2, col1=0.15379736506356667, col2=0.3145737215530181, col3=0.4209091263821808, col4=0.6216213485627781)
0.15379736506356667
0.3145737215530181
####################
Pandas(Index=3, col1=0.17046373836968765, col2=0.7544702962109139, col3=0.9325636074704018, col4=0.5032743707161728)
0.17046373836968765
0.7544702962109139
####################
Pandas(Index=4, col1=0.5300257318357422, col2=0.5810006105706884, col3=0.9149300917401895, col4=0.4679368395500929)
0.5300257318357422
0.5810006105706884
####################

# GroupBy operations

In [48]:
world_cup = {'Team':['West Indies', 'West Indies', 'India', 'Australia',
                     'Pakistan', 'Sri Lanka', 'Australia', 'Australia','Australia',
                     'India','Australia'],
            'Rank':[7,7,2,1,6,4,1,1,1,2,1],
            'Year':[1975, 1979, 1983, 1987, 1992, 1996, 1999,2003, 2007,2011, 2015]}
df = pd.DataFrame(world_cup)
df

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     1  2015

In [49]:
# groupby()
df.groupby('Team')

In [51]:
# to see the grouped values in single shot
df.groupby('Team').groups

{'Australia': Int64Index([3, 6, 7, 8, 10], dtype='int64'),
 'India': Int64Index([2, 9], dtype='int64'),
 'Pakistan': Int64Index([4], dtype='int64'),
 'Sri Lanka': Int64Index([5], dtype='int64'),
 'West Indies': Int64Index([0, 1], dtype='int64')}

In [53]:
# multiple columns grouping
df.groupby(['Team', 'Rank']).groups

{('Australia', 1): Int64Index([3, 6, 7, 8, 10], dtype='int64'),
 ('India', 2): Int64Index([2, 9], dtype='int64'),
 ('Pakistan', 6): Int64Index([4], dtype='int64'),
 ('Sri Lanka', 4): Int64Index([5], dtype='int64'),
 ('West Indies', 7): Int64Index([0, 1], dtype='int64')}

In [55]:
# groups can be iterated over just like using itertools
for group_key, group_value in df.groupby('Team'):
    print(group_key)
    print(group_value)
    print("#"*20)

Australia
         Team  Rank  Year
3   Australia     1  1987
6   Australia     1  1999
7   Australia     1  2003
8   Australia     1  2007
10  Australia     1  2015
####################
India
    Team  Rank  Year
2  India     2  1983
9  India     2  2011
####################
Pakistan
       Team  Rank  Year
4  Pakistan     6  1992
####################
Sri Lanka
        Team  Rank  Year
5  Sri Lanka     4  1996
####################
West Indies
          Team  Rank  Year
0  West Indies     7  1975
1  West Indies     7  1979
####################

In [56]:
# a single group can also be selected using get_group()
grouped = df.groupby('Team')
grouped.get_group('India')

    Team  Rank  Year
2  India     2  1983
9  India     2  2011

In [59]:
# a single group can also be selected using get_group()
grouped = df.groupby('Team')
print(type(grouped.get_group('India')))
# to get DF summary
print(grouped.get_group('India').describe())

<class 'pandas.core.frame.DataFrame'>
       Rank        Year
count   2.0     2.00000
mean    2.0  1997.00000
std     0.0    19.79899
min     2.0  1983.00000
25%     2.0  1990.00000
50%     2.0  1997.00000
75%     2.0  2004.00000
max     2.0  2011.00000

## Concatenation
- process of combining two or more data structures

In [60]:
import pandas as pd

world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

In [63]:
# concat()
concatenated_df = pd.concat([df1, df2], sort=True)
concatenated_df

   ICC_rank  Points          Team  World_champions_Year
0         2     874         India                2011.0
1         3     787     Australia                2015.0
2         7     753   West Indies                1979.0
3         8     673      Pakistan                1992.0
4         4     855     Sri Lanka                1996.0
0         1     895  South Africa                   NaN
1         5     764   New Zealand                   NaN
2         9     656      Zimbabwe                   NaN

In [64]:
# iloc takes index postition from the top.
concatenated_df.iloc[0]

ICC_rank                    2
Points                    874
Team                    India
World_champions_Year     2011
Name: 0, dtype: object

In [65]:
concatenated_df.iloc[5]

ICC_rank                           1
Points                           895
Team                    South Africa
World_champions_Year             NaN
Name: 0, dtype: object

In [66]:
# access via index value
concatenated_df.loc[0]

   ICC_rank  Points          Team  World_champions_Year
0         2     874         India                2011.0
0         1     895  South Africa                   NaN

In [68]:
# 2.concantenation can also be done with the df.append()

import pandas as pd

world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['South Africa','New Zealand','Zimbabwe'],
           'ICC_rank':[1,5,9],
           'Points':[895,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)

print("********** Appending/concatenating *******")
new_df = df1.append(df2, sort=True)
print(new_df)

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656
********** Appending/concatenating *******
   ICC_rank  Points          Team  World_champions_Year
0         2     874         India                2011.0
1         3     787     Australia                2015.0
2         7     753   West Indies                1979.0
3         8     673      Pakistan                1992.0
4         4     855     Sri Lanka                1996.0
0         1     895  South Africa                   NaN
1         5     764   New Zealand                   NaN
2         9     656      Zimbabwe                   NaN

In [69]:
# axis=1 puts the second df as new columns in concatenation process
pd.concat([df1, df2], axis=1)

,Team,ICC_rank,World_champions_Year,Points,Team,ICC_rank,Points
0,India,2,2011,874,South Africa,1.0,895.0
1,Australia,3,2015,787,New Zealand,5.0,764.0
2,West Indies,7,1979,753,Zimbabwe,9.0,656.0
3,Pakistan,8,1992,673,NaN,NaN,NaN
4,Sri Lanka,4,1996,855,NaN,NaN,NaN

In [70]:
new_df = pd.concat([df1, df2], axis=1)
print(new_df)

          Team  ICC_rank  World_champions_Year  Points          Team  \
0        India         2                  2011     874  South Africa
1    Australia         3                  2015     787   New Zealand
2  West Indies         7                  1979     753      Zimbabwe
3     Pakistan         8                  1992     673           NaN
4    Sri Lanka         4                  1996     855           NaN

   ICC_rank  Points
0       1.0   895.0
1       5.0   764.0
2       9.0   656.0
3       NaN     NaN
4       NaN     NaN

In [71]:
new_df['Team']  # multiple columns with same name

          Team          Team
0        India  South Africa
1    Australia   New Zealand
2  West Indies      Zimbabwe
3     Pakistan           NaN
4    Sri Lanka           NaN

## acces a column using iloc

In [81]:
"""
# synatx: .iloc to access columns
# 1.df.iloc[:,column_position]
# 2.df.iloc[:,[list_of_column_index_positions]]

synatx: .loc to access columns
# df.loc[:,[list_of_column_names]]
"""

team_df = new_df['Team'] 
#team_df.iloc[:,[0,1]]
#team_df.iloc[:,0]
print(team_df.iloc[:,0])
print(team_df.iloc[:,1])

0          India
1      Australia
2    West Indies
3       Pakistan
4      Sri Lanka
Name: Team, dtype: object
0    South Africa
1     New Zealand
2        Zimbabwe
3             NaN
4             NaN
Name: Team, dtype: object

## Merging and Joining

In [88]:
# inner join returns intersection of two Dataframes.
world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['India','New Zealand','Zimbabwe'],
           'ICC_rank':[2,5,9],
           'Points':[874,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)
print(" *******Default is Inner Join Merge*********")
print(pd.merge(df1, df2, on='Team'))

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
          Team  ICC_rank  Points
0        India         2     874
1  New Zealand         5     764
2     Zimbabwe         9     656
 *******Default is Inner Join Merge*********
    Team  ICC_rank_x  World_champions_Year  Points_x  ICC_rank_y  Points_y
0  India           2                  2011       874           2       874

In [85]:
# right join merges two dataframes based on the keys of the right dataframe
world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['India','New Zealand','Zimbabwe'],
           'ICC_rank':[2,5,9],
           'Points':[874,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)
print(" *******Right Join Merge*********")
print(pd.merge(df1, df2, on='Team', how='right'))

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
          Team  ICC_rank  Points
0        India         2     874
1  New Zealand         5     764
2     Zimbabwe         9     656
 *******Right Join Merge*********
          Team  ICC_rank_x  World_champions_Year  Points_x  ICC_rank_y  \
0        India         2.0                2011.0     874.0           2
1  New Zealand         NaN                   NaN       NaN           5
2     Zimbabwe         NaN                   NaN       NaN           9

   Points_y
0       874
1       764
2       656

In [86]:
# left join merges two dataframes based on the keys of the left dataframe
world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['India','New Zealand','Zimbabwe'],
           'ICC_rank':[2,5,9],
           'Points':[874,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)
print(" *******Left Join Merge*********")
print(pd.merge(df1, df2, on='Team', how='left'))

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
          Team  ICC_rank  Points
0        India         2     874
1  New Zealand         5     764
2     Zimbabwe         9     656
 *******Left Join Merge*********
          Team  ICC_rank_x  World_champions_Year  Points_x  ICC_rank_y  \
0        India           2                  2011       874         2.0
1    Australia           3                  2015       787         NaN
2  West Indies           7                  1979       753         NaN
3     Pakistan           8                  1992       673         NaN
4    Sri Lanka           4                  1996       855         NaN

   Points_y
0     874.0
1       NaN
2       NaN
3       NaN
4       NaN

In [87]:
# outer join merges two dataframes based on the full union
world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['India','New Zealand','Zimbabwe'],
           'ICC_rank':[2,5,9],
           'Points':[874,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)
print(" *******outer Join Merge*********")
print(pd.merge(df1, df2, on='Team', how='outer'))

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
          Team  ICC_rank  Points
0        India         2     874
1  New Zealand         5     764
2     Zimbabwe         9     656
 *******outer Join Merge*********
          Team  ICC_rank_x  World_champions_Year  Points_x  ICC_rank_y  \
0        India         2.0                2011.0     874.0         2.0
1    Australia         3.0                2015.0     787.0         NaN
2  West Indies         7.0                1979.0     753.0         NaN
3     Pakistan         8.0                1992.0     673.0         NaN
4    Sri Lanka         4.0                1996.0     855.0         NaN
5  New Zealand         NaN                   NaN       NaN         5.0
6     Zimbabwe         NaN                   NaN       NaN         9.0

   Points_y
0     874.0
1       NaN
2       NaN
3       NaN
4       NaN
5     764.0
6     656.0

In [89]:
# inner join returns intersection of two Dataframes.
world_champions={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
           'ICC_rank':[2,3,7,8,4],
           'World_champions_Year':[2011,2015,1979,1992,1996],
           'Points':[874,787,753,673,855]}

chokers={'Team':['India','New Zealand','Zimbabwe'],
           'ICC_rank':[2,5,9],
           'Points':[874,764,656]}
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)
print("DF1: World champions")
print(df1)
print("#"*20)
print("DF2: Chokers")
print(df2)
print(" *******Inner Join Merge*********")
print(pd.merge(df1, df2, on='Team', how='inner'))

DF1: World champions
          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855
####################
DF2: Chokers
          Team  ICC_rank  Points
0        India         2     874
1  New Zealand         5     764
2     Zimbabwe         9     656
 *******Inner Join Merge*********
    Team  ICC_rank_x  World_champions_Year  Points_x  ICC_rank_y  Points_y
0  India           2                  2011       874           2       874